package com.mooddiary.app.model

import com.mooddiary.app.AdviceCountRoute
import com.mooddiary.app.AdvicePuzzleRoute
import com.mooddiary.app.AdviceResourcesRoute
import com.mooddiary.app.AdviceRoudeRoute
import com.mooddiary.app.AdviceSleepRoute
import com.mooddiary.app.R

data class Advice(val imdID: Int, val title: String, val descr: String)

val advicesList = listOf(
    Advice(
        imdID = R.drawable.count_img,
        title = "Рахуй овець, але не проблеми: ритуали сну й заспокоєння",
        descr = "Якісний сон часто залежить не лише від фізичних умов, а й від психологічного налаштування перед сном. Ритуали сну — це свідомі або автоматичні дії, які допомагають організму і мозку перейти в стан розслаблення та підготуватися до відпочинку. Вони знижують рівень стресу, стабілізують емоції і роблять засинання легшим.\n" +
                "\n" +
                "Класичний приклад — рахування овець, хоча сучасні дослідження показують, що краще фокусувати увагу на спокійних, позитивних образах або повторювати заспокійливі мантри. Це відволікає мозок від турбот і проблем, які можуть викликати тривогу і безсоння.\n" +
                "\n" +
                "Популярні та ефективні ритуали сну включають:\n" +
                "\n" +
                "- Регулярний час лягання. Відсутність хаосу у графіку дає організму сигнал, що час для відпочинку.\n" +
                "\n" +
                "- Вимкнення гаджетів за 1-2 години до сну. Світло екранів пригнічує мелатонін і стимулює мозок, заважаючи розслабленню.\n" +
                "\n" +
                "- Техніки дихання та релаксації. Повільне глибоке дихання, прогресивна м’язова релаксація або медитація знижують активність симпатичної нервової системи.\n" +
                "\n" +
                "- Читання легкої книги або слухання заспокійливої музики. Це знижує психоемоційне напруження.\n" +
                "\n" +
                "- Тепла ванна або ароматерапія. Тепло розслаблює м’язи, а ефірні олії лаванди чи ромашки діють як природні седативні засоби.\n" +
                "\n" +
                "Ритуали сну працюють як «переключення» для мозку — вони допомагають відокремити час сну від денних справ і проблем, що особливо важливо в умовах сучасного інформаційного перенасичення."
    ),
    Advice(
        imdID = R.drawable.pazzle_img,
        title = "Зібрати себе заново: усвідомлення власної цілісності",
        descr = "Причини:\n" +
                "- Хронічний стрес або емоційне вигорання — з часом змушують «розсипатись» на частини: ти більше не відчуваєш, хто ти, чого хочеш, де твої межі.\n" +
                "\n" +
                "- Травматичні події (війна, втрата, розлучення, насильство, тощо.) — часто «вибивають» із себе настільки, що здається: я — не я.\n" +
                "\n" +
                "- Надмірна адаптація під очікування інших — коли постійно граєш ролі, щоб подобатись, бути зручним, «успішним», а в результаті втрачаєш зв’язок із собою.\n" +
                "\n" +
                "- Внутрішній критик і перфекціонізм — змушують постійно ламати себе заради ідеалу, і жодна частинка більше не почувається прийнятою.\n" +
                "\n" +
                "- Інші причини.\n" +
                "\n" +
                " Наслідки:\n" +
                "\n" +
                "- Відчуття порожнечі та втрати сенсу.\n" +
                "\n" +
                "- Емоційна байдужість або, навпаки, вибухова чутливість.\n" +
                "\n" +
                "- Відчуття «я не знаю, хто я».\n" +
                "\n" +
                "- Важкість приймати рішення, бо немає внутрішньої опори.\n" +
                "\n" +
                "- Соматичні прояви: втома, апатія, безсоння, психосоматика.\n" +
                "\n" +
                " Як зібрати себе заново:\n" +
                "\n" +
                "1. Прийняти розкиданість як частину процесу. Не лаяти себе за стан, а визнати: так, я зараз у моменті пошуку. І це окей.\n" +
                "\n" +
                "2. Почати з малого: щоденне самоспостереження.\n" +
                "\n" +
                "- Що я зараз відчуваю?\n" +
                "\n" +
                "- Чого я хочу прямо зараз?\n" +
                "\n" +
                "- Що мені приносить полегшення або радість?\n" +
                "\n" +
                "3.Відновити зв’язок із тілом.\n" +
                "Тіло — твій фундамент. Дихання, рух, сон, тілесні практики (йога, танець, обійми, душ, тощо) повертають контроль.\n" +
                "\n" +
                "4. Знайти загублену частинку пазла : які частини мене я загубив(ла)?\n" +
                "\n" +
                "- Колишні хобі.\n" +
                "\n" +
                "- Мрії, які колись були.\n" +
                "\n" +
                "- Риси, які я собі заборонив(ла).\n" +
                "\n" +
                "- Інше.\n" +
                "\n" +
                "5. Психотерапія або щирі розмови\n" +
                "\n" +
                "Спілкування з тими, хто не оцінює, а просто є — допомагає побачити себе у віддзеркаленні.\n" +
                "\n" +
                "6. Побудова безпечного острівка у складні часи.\n" +
                "\n" +
                "Це твій простір, ритуали, обійми, речі, що повертають до «я в порядку, я живу»."
    ),
    Advice(
        imdID = R.drawable.resources_img,
        title = "Мікроресурси: радість у простих речах",
        descr = "Що це взагалі таке?\n" +
                "\n" +
                "Мікроресурси — це дрібниці, які не вирішують усі проблеми,\n" +
                "але здатні втримати тебе над водою сьогодні.\n" +
                "Це — міні-пауза життя, мікродоза щастя, теплота в середині, яка хоч на секунду перекриває біль, втому або тривогу.\n" +
                "\n" +
                "Чому вони важливі?\n" +
                "\n" +
                "Наша психіка працює \"від моменту до моменту\".\n" +
                "Їй не треба мега-досягнень. Їй потрібно зараз: безпечно, приємно, зрозуміло.\n" +
                "\n" +
                "Велике щастя формується з малих \"о, як добре\".\n" +
                "Теплий плед, аромат чаю, сонце на обличчі — це не банальність. Це — ґрунт.\n" +
                "\n" +
                "У стані виснаження велика дія неможлива.\n" +
                "А от мікрокрок — цілком. І це вже підтримка.\n" +
                "\n" +
                "Як це працює?\n" +
                "Мікроресурси = дії, думки або відчуття, які:\n" +
                "- дають спокій / комфорт / тепло.\n" +
                "- не вимагають зусиль.\n" +
                "- доступні прямо зараз.\n" +
                "\n" +
                "Приклади мікроресурсів:\n" +
                "-Улюблена чашка з чаєм (не просто чай — а з тої чашки, знаєш?)\n" +
                "\n" +
                "- Трек, який обіймає тебе зсередини.\n" +
                "\n" +
                "- Свічка з ароматом дитинства.\n" +
                "\n" +
                "- Складені речі після прибирання — оте почуття \"я впорядкував хаос\".\n" +
                "\n" +
                "- Спостерігати, як котик спить (або собака дихає у сні ).\n" +
                "\n" +
                "- Теплий промінь сонця на ліжку.\n" +
                "\n" +
                "- Голос близької людини / смішне повідомлення / мем.\n" +
                "\n" +
                "- Душ, який змиває \"все зайве\".\n" +
                "\n" +
                "- 3 сторінки книги, де добре.\n" +
                "\n" +
                "- 30 секунд обіймів, навіть уявних.\n" +
                "\n" +
                " Як зробити це практикою:\n" +
                "\n" +
                "1. Завести список “Мої мікроресурси”.Пиши все, що дає тепло. Навіть якщо це \"подивитися, як летять голуби\" .\n" +
                "\n" +
                "2. Вбудовуй їх у день.\n" +
                "Не \"після роботи\" чи \"після важливого\". А під час. Вони — частина опори.\n" +
                "\n" +
                "3. Не знецінюй. Це не \"дрібниця\", це — твій резерв живого.\n" +
                "\n" +
                "4. Ділись.\n" +
                "Запитай в друзів: “А що для тебе мікроресурс?” — це надихаючі розмови."
    ),
    Advice(
        imdID = R.drawable.roude_img,
        title = "Шлях із глибини: як знайти світло в собі",
        descr = "Причини, чому ти можеш опинитися «у темряві»:\n" +
                "\n" +
                "- Життєві втрати: близькі, дім, мрії, стабільність — усе, що тримало.\n" +
                "\n" +
                "- Депресія або виснаження — коли тіло функціонує, а душа як на паузі.\n" +
                "\n" +
                "- Відчуття самотності навіть у натовпі — ніхто «не бачить» справжнього тебе.\n" +
                "\n" +
                "- Втрата себе через відповідальність, війну, тривоги, кризу сенсів.\n" +
                "\n" +
                "Що відбувається у цей час з тобою?\n" +
                "\n" +
                "- Ти ніби тонеш у собі — немає опори, і все навколо «без смаку».\n" +
                "\n" +
                "- Прокрастинація, безсилля, сльози на рівному місці.\n" +
                "\n" +
                "- Тиша в голові або навпаки — крик, тривога, хаос.\n" +
                "\n" +
                "- Сумніви типу: «А чи є у мені ще щось живе?..»\n" +
                "\n" +
                "Так ік вирішити цю проблему?\n" +
                "\n" +
                "1. Визнати, що ти в темряві.\n" +
                "\n" +
                "Без цього неможливо рушити. Це не поразка — це стартова точка.\n" +
                "\n" +
                "2. Шукати не великий прожектор, а крихітну іскорку.\n" +
                "\n" +
                "Світло — це не завжди осяяння. Іноді це 5 хвилин під ковдрою без тривог.\n" +
                "Іноді — кава з другом. Іноді — пісня, яка тебе рятувала в 2017-му.\n" +
                "\n" +
                "3. Повертати собі речі, які оживляють.\n" +
                "\n" +
                "- Слухати себе тілом: що дає тепло?\n" +
                "\n" +
                "- Виписувати все, що болить.\n" +
                "\n" +
                "- Малювати.\n" +
                "\n" +
                "- Слухати, як б’ється серце: це вже життя.\n" +
                "\n" +
                "4. Звузити фокус до \"тут і зараз\".\n" +
                "\n" +
                "Не треба знати, що буде далі. Спитай себе:\n" +
                "\n" +
                "- Що мені потрібно сьогодні, щоб вижити?\n" +
                "-  Що зараз дає мені хоч краплю полегшення?\n" +
                "\n" +
                "5. Не йти сам(а), коли важко.\n" +
                "\n" +
                "Світло часто приходить через іншу людину. І це не слабкість — це сила довіри.\n" +
                "Якщо немає поруч — звернись до фахівця. Це нормально.\n" +
                "\n" +
                "6. Вірити, що світло — це не щось зовнішнє. Це ти.\n" +
                "\n" +
                "Світло в тобі не зникає. Воно просто притихло, бо втомилось. Але ти можеш його розпалити знову. Маленькими кроками. Диханням. Поглядом у себе."
    ),
    Advice(
        imdID = R.drawable.sleep_img,
        title = "Тиша, яка лікує: важливість якісного сну",
        descr = "Якісний сон є ключовим фактором підтримки фізичного та психічного здоров’я людини. Під час сну відбуваються критично важливі процеси відновлення організму: регенерація клітин, укріплення імунної системи, консолидація пам’яті та регуляція емоційного стану. Недостатність або низька якість сну призводить до порушення когнітивних функцій, зниження уваги, підвищення ризику розвитку серцево-судинних захворювань, діабету, депресії та інших хронічних станів.\n" +
                "\n" +
                "Фізіологічно сон поділяється на кілька фаз, зокрема швидкий (REM) та повільний (Non-REM) сон, які виконують різні, але взаємодоповнюючі функції. Фаза повільного сну відповідає за відновлення фізичних ресурсів організму, тоді як REM-сон необхідний для обробки емоцій та формування довготривалої пам’яті. Порушення балансу між цими фазами негативно впливає на загальний стан здоров’я.\n" +
                "\n" +
                "Для покращення якості сну рекомендовано дотримуватися таких науково обґрунтованих практик:\n" +
                "\n" +
                "- Регулярність сну. Лягаючи і прокидаючись в один і той самий час щодня, можна налаштувати циркадні ритми, що сприяє більш глибокому і відновлювальному сну.\n" +
                "\n" +
                "- Оптимальні умови в спальні. Температура повітря 18–22°C, мінімальний рівень шуму та повна темрява сприяють легшому засипанню та утриманню сну.\n" +
                "\n" +
                "- Обмеження впливу синього світла перед сном. Використання екранів гаджетів у вечірній час пригнічує вироблення мелатоніну — гормону сну, що ускладнює засипання.\n" +
                "\n" +
                "- Фізична активність. Регулярні помірні фізичні навантаження підвищують якість сну, однак слід уникати інтенсивних тренувань безпосередньо перед сном.\n" +
                "\n" +
                "- Уникнення стимуляторів. Кофеїн, нікотин та алкоголь можуть порушувати структуру сну і викликати часті пробудження.\n" +
                "\n" +
                "- Психологічна гігієна. Техніки релаксації, медитація або легке читання допомагають знизити рівень тривоги та підготувати мозок до сну.\n" +
                "\n" +
                "Виконання цих рекомендацій сприяє відновленню нормального циклу сну, що, у свою чергу, підтримує оптимальний функціональний стан організму і знижує ризик розвитку соматичних та психічних захворювань."
    )
)

val advicesRoutesList = listOf(
    AdviceCountRoute,
    AdvicePuzzleRoute,
    AdviceResourcesRoute,
    AdviceRoudeRoute,
    AdviceSleepRoute
)
